"""триатические агентства предлагают следующие туры. Вояк - Мексика, Канада, Изранл
галия, США. РейнаТур - Англия, Япония, Канада, ЮАР. Радуга - США,Испания, Швеци
 Определить в каких турагенствах можно приобрести туры в Канаду, а в каких в США"""

check_1 = "Канада"
check_2 = "США"
try:
    #туры
    voyage = {"Мексика", "Канада", "Израиль", "Италия", "США"}
    reyna_tur = {"Англия", "Япония", "Канада", "ЮАР"}
    radugs = {"США", "Испания", "Швеция", "Австралия"}

    print("Туры в Канаду можно приобрести в:")
    if "Канада" in voyage:
        print("Вояж")
    if "Канада" in reyna_tur:
        print("РейнаТур")
    if "Канада" in radugs:
        print("Радуга")

    print("\nТуры в США можно приобрести в:")
    if "США" in voyage:
        print("Вояж")
    if "США" in reyna_tur:
        print("РейнаТур")
    if "США" in radugs:
        print("Радуга")


except ValueError as e:
    print(f"Произошла ошибка - {e}")